Simsoniteee/TestRepo/F2837x_uart_fifo/device/driverlib/inc/hw_gpio.h
//###########################################################################
//
// FILE:    hw_gpio.h
//
// TITLE:   Definitions for the GPIO registers.
//
//###########################################################################
// $TI Release: F2837xD Support Library v3.01.00.00 $
// $Release Date: Mon May 22 15:43:40 CDT 2017 $
// $Copyright:
// Copyright (C) 2013-2017 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_GPIO_H
#define HW_GPIO_H

//*****************************************************************************
//
// The following are defines for the GPIO register offsets
//
//*****************************************************************************
#define GPIO_O_GPACTRL            0x0U         // GPIO A Qualification Sampling
                                               // Period Control (GPIO0 to 31)
#define GPIO_O_GPAQSEL1           0x2U         // GPIO A Qualifier Select 1
                                               // Register (GPIO0 to 15)
#define GPIO_O_GPAQSEL2           0x4U         // GPIO A Qualifier Select 2
                                               // Register (GPIO16 to 31)
#define GPIO_O_GPAMUX1            0x6U         // GPIO A Mux 1 Register (GPIO0
                                               // to 15)
#define GPIO_O_GPAMUX2            0x8U         // GPIO A Mux 2 Register (GPIO16
                                               // to 31)
#define GPIO_O_GPADIR             0xAU         // GPIO A Direction Register
                                               // (GPIO0 to 31)
#define GPIO_O_GPAPUD             0xCU         // GPIO A Pull Up Disable
                                               // Register (GPIO0 to 31)
#define GPIO_O_GPAINV             0x10U        // GPIO A Input Polarity Invert
                                               // Registers (GPIO0 to 31)
#define GPIO_O_GPAODR             0x12U        // GPIO A Open Drain Output
                                               // Register (GPIO0 to GPIO31)
#define GPIO_O_GPAGMUX1           0x20U        // GPIO A Peripheral Group Mux
                                               // (GPIO0 to 15)
#define GPIO_O_GPAGMUX2           0x22U        // GPIO A Peripheral Group Mux
                                               // (GPIO16 to 31)
#define GPIO_O_GPACSEL1           0x28U        // GPIO A Core Select Register
                                               // (GPIO0 to 7)
#define GPIO_O_GPACSEL2           0x2AU        // GPIO A Core Select Register
                                               // (GPIO8 to 15)
#define GPIO_O_GPACSEL3           0x2CU        // GPIO A Core Select Register
                                               // (GPIO16 to 23)
#define GPIO_O_GPACSEL4           0x2EU        // GPIO A Core Select Register
                                               // (GPIO24 to 31)
#define GPIO_O_GPALOCK            0x3CU        // GPIO A Lock Configuration
                                               // Register (GPIO0 to 31)
#define GPIO_O_GPACR              0x3EU        // GPIO A Lock Commit Register
                                               // (GPIO0 to 31)
#define GPIO_O_GPBCTRL            0x40U        // GPIO B Qualification Sampling
                                               // Period Control (GPIO32 to 63)
#define GPIO_O_GPBQSEL1           0x42U        // GPIO B Qualifier Select 1
                                               // Register (GPIO32 to 47)
#define GPIO_O_GPBQSEL2           0x44U        // GPIO B Qualifier Select 2
                                               // Register (GPIO48 to 63)
#define GPIO_O_GPBMUX1            0x46U        // GPIO B Mux 1 Register (GPIO32
                                               // to 47)
#define GPIO_O_GPBMUX2            0x48U        // GPIO B Mux 2 Register (GPIO48
                                               // to 63)
#define GPIO_O_GPBDIR             0x4AU        // GPIO B Direction Register
                                               // (GPIO32 to 63)
#define GPIO_O_GPBPUD             0x4CU        // GPIO B Pull Up Disable
                                               // Register (GPIO32 to 63)
#define GPIO_O_GPBINV             0x50U        // GPIO B Input Polarity Invert
                                               // Registers (GPIO32 to 63)
#define GPIO_O_GPBODR             0x52U        // GPIO B Open Drain Output
                                               // Register (GPIO32 to GPIO63)
#define GPIO_O_GPBAMSEL           0x54U        // GPIO B Analog Mode Select
                                               // register (GPIO32 to GPIO63)
#define GPIO_O_GPBGMUX1           0x60U        // GPIO B Peripheral Group Mux
                                               // (GPIO32 to 47)
#define GPIO_O_GPBGMUX2           0x62U        // GPIO B Peripheral Group Mux
                                               // (GPIO48 to 63)
#define GPIO_O_GPBCSEL1           0x68U        // GPIO B Core Select Register
                                               // (GPIO32 to 39)
#define GPIO_O_GPBCSEL2           0x6AU        // GPIO B Core Select Register
                                               // (GPIO40 to 47)
#define GPIO_O_GPBCSEL3           0x6CU        // GPIO B Core Select Register
                                               // (GPIO48 to 55)
#define GPIO_O_GPBCSEL4           0x6EU        // GPIO B Core Select Register
                                               // (GPIO56 to 63)
#define GPIO_O_GPBLOCK            0x7CU        // GPIO B Lock Configuration
                                               // Register (GPIO32 to 63)
#define GPIO_O_GPBCR              0x7EU        // GPIO B Lock Commit Register
                                               // (GPIO32 to 63)
#define GPIO_O_GPCCTRL            0x80U        // GPIO C Qualification Sampling
                                               // Period Control (GPIO64 to 95)
#define GPIO_O_GPCQSEL1           0x82U        // GPIO C Qualifier Select 1
                                               // Register (GPIO64 to 79)
#define GPIO_O_GPCQSEL2           0x84U        // GPIO C Qualifier Select 2
                                               // Register (GPIO80  to 95)
#define GPIO_O_GPCMUX1            0x86U        // GPIO C Mux 1 Register (GPIO64
                                               // to 79)
#define GPIO_O_GPCMUX2            0x88U        // GPIO C Mux 2 Register (GPIO80
                                               //  to 95)
#define GPIO_O_GPCDIR             0x8AU        // GPIO C Direction Register
                                               // (GPIO64 to 95)
#define GPIO_O_GPCPUD             0x8CU        // GPIO C Pull Up Disable
                                               // Register (GPIO64 to 95)
#define GPIO_O_GPCINV             0x90U        // GPIO C Input Polarity Invert
                                               // Registers (GPIO64 to 95)
#define GPIO_O_GPCODR             0x92U        // GPIO C Open Drain Output
                                               // Register (GPIO64 to GPIO95)
#define GPIO_O_GPCGMUX1           0xA0U        // GPIO C Peripheral Group Mux
                                               // (GPIO64 to 79)
#define GPIO_O_GPCGMUX2           0xA2U        // GPIO C Peripheral Group Mux
                                               // (GPIO80  to 95)
#define GPIO_O_GPCCSEL1           0xA8U        // GPIO C Core Select Register
                                               // (GPIO64 to 71)
#define GPIO_O_GPCCSEL2           0xAAU        // GPIO C Core Select Register
                                               // (GPIO72 to 79)
#define GPIO_O_GPCCSEL3           0xACU        // GPIO C Core Select Register
                                               // (GPIO80  to 87)
#define GPIO_O_GPCCSEL4           0xAEU        // GPIO C Core Select Register
                                               // (GPIO88 to 95)
#define GPIO_O_GPCLOCK            0xBCU        // GPIO C Lock Configuration
                                               // Register (GPIO64 to 95)
#define GPIO_O_GPCCR              0xBEU        // GPIO C Lock Commit Register
                                               // (GPIO64 to 95)
#define GPIO_O_GPDCTRL            0xC0U        // GPIO D Qualification Sampling
                                               // Period Control (GPIO96 to
                                               // 127)
#define GPIO_O_GPDQSEL1           0xC2U        // GPIO D Qualifier Select 1
                                               // Register (GPIO96 to 111)
#define GPIO_O_GPDQSEL2           0xC4U        // GPIO D Qualifier Select 2
                                               // Register (GPIO112 to 127)
#define GPIO_O_GPDMUX1            0xC6U        // GPIO D Mux 1 Register (GPIO96
                                               // to 111)
#define GPIO_O_GPDMUX2            0xC8U        // GPIO D Mux 2 Register
                                               // (GPIO112 to 127)
#define GPIO_O_GPDDIR             0xCAU        // GPIO D Direction Register
                                               // (GPIO96 to 127)
#define GPIO_O_GPDPUD             0xCCU        // GPIO D Pull Up Disable
                                               // Register (GPIO96 to 127)
#define GPIO_O_GPDINV             0xD0U        // GPIO D Input Polarity Invert
                                               // Registers (GPIO96 to 127)
#define GPIO_O_GPDODR             0xD2U        // GPIO D Open Drain Output
                                               // Register (GPIO96 to GPIO127)
#define GPIO_O_GPDGMUX1           0xE0U        // GPIO D Peripheral Group Mux
                                               // (GPIO96 to 111)
#define GPIO_O_GPDGMUX2           0xE2U        // GPIO D Peripheral Group Mux
                                               // (GPIO112 to 127)
#define GPIO_O_GPDCSEL1           0xE8U        // GPIO D Core Select Register
                                               // (GPIO96 to 103)
#define GPIO_O_GPDCSEL2           0xEAU        // GPIO D Core Select Register
                                               // (GPIO104 to 111)
#define GPIO_O_GPDCSEL3           0xECU        // GPIO D Core Select Register
                                               // (GPIO112 to 119)
#define GPIO_O_GPDCSEL4           0xEEU        // GPIO D Core Select Register
                                               // (GPIO120 to 127)
#define GPIO_O_GPDLOCK            0xFCU        // GPIO D Lock Configuration
                                               // Register (GPIO96 to 127)
#define GPIO_O_GPDCR              0xFEU        // GPIO D Lock Commit Register
                                               // (GPIO96 to 127)
#define GPIO_O_GPECTRL            0x100U       // GPIO E Qualification Sampling
                                               // Period Control (GPIO128 to
                                               // 159)
#define GPIO_O_GPEQSEL1           0x102U       // GPIO E Qualifier Select 1
                                               // Register (GPIO128 to 143)
#define GPIO_O_GPEQSEL2           0x104U       // GPIO E Qualifier Select 2
                                               // Register (GPIO144  to 159)
#define GPIO_O_GPEMUX1            0x106U       // GPIO E Mux 1 Register
                                               // (GPIO128 to 143)
#define GPIO_O_GPEMUX2            0x108U       // GPIO E Mux 2 Register
                                               // (GPIO144  to 159)
#define GPIO_O_GPEDIR             0x10AU       // GPIO E Direction Register
                                               // (GPIO128 to 159)
#define GPIO_O_GPEPUD             0x10CU       // GPIO E Pull Up Disable
                                               // Register (GPIO128 to 159)
#define GPIO_O_GPEINV             0x110U       // GPIO E Input Polarity Invert
                                               // Registers (GPIO128 to 159)
#define GPIO_O_GPEODR             0x112U       // GPIO E Open Drain Output
                                               // Register (GPIO128 to GPIO159)
#define GPIO_O_GPEGMUX1           0x120U       // GPIO E Peripheral Group Mux
                                               // (GPIO128 to 143)
#define GPIO_O_GPEGMUX2           0x122U       // GPIO E Peripheral Group Mux
                                               // (GPIO144  to 159)
#define GPIO_O_GPECSEL1           0x128U       // GPIO E Core Select Register
                                               // (GPIO128 to 135)
#define GPIO_O_GPECSEL2           0x12AU       // GPIO E Core Select Register
                                               // (GPIO136 to 143)
#define GPIO_O_GPECSEL3           0x12CU       // GPIO E Core Select Register
                                               // (GPIO144  to 151)
#define GPIO_O_GPECSEL4           0x12EU       // GPIO E Core Select Register
                                               // (GPIO152 to 159)
#define GPIO_O_GPELOCK            0x13CU       // GPIO E Lock Configuration
                                               // Register (GPIO128 to 159)
#define GPIO_O_GPECR              0x13EU       // GPIO E Lock Commit Register
                                               // (GPIO128 to 159)
#define GPIO_O_GPFCTRL            0x140U       // GPIO F Qualification Sampling
                                               // Period Control (GPIO160 to
                                               // 168)
#define GPIO_O_GPFQSEL1           0x142U       // GPIO F Qualifier Select 1
                                               // Register (GPIO160 to 168)
#define GPIO_O_GPFMUX1            0x146U       // GPIO F Mux 1 Register
                                               // (GPIO160 to 168)
#define GPIO_O_GPFDIR             0x14AU       // GPIO F Direction Register
                                               // (GPIO160 to 168)
#define GPIO_O_GPFPUD             0x14CU       // GPIO F Pull Up Disable
                                               // Register (GPIO160 to 168)
#define GPIO_O_GPFINV             0x150U       // GPIO F Input Polarity Invert
                                               // Registers (GPIO160 to 168)
#define GPIO_O_GPFODR             0x152U       // GPIO F Open Drain Output
                                               // Register (GPIO160 to GPIO168)
#define GPIO_O_GPFGMUX1           0x160U       // GPIO F Peripheral Group Mux
                                               // (GPIO160 to 168)
#define GPIO_O_GPFCSEL1           0x168U       // GPIO F Core Select Register
                                               // (GPIO160 to 167)
#define GPIO_O_GPFCSEL2           0x16AU       // GPIO F Core Select Register
                                               // (GPIO168)
#define GPIO_O_GPFLOCK            0x17CU       // GPIO F Lock Configuration
                                               // Register (GPIO160 to 168)
#define GPIO_O_GPFCR              0x17EU       // GPIO F Lock Commit Register
                                               // (GPIO160 to 168)
#define GPIO_O_GPADAT             0x0U         // GPIO A Data Register (GPIO0
                                               // to 31)
#define GPIO_O_GPASET             0x2U         // GPIO A Data Set Register
                                               // (GPIO0 to 31)
#define GPIO_O_GPACLEAR           0x4U         // GPIO A Data Clear Register
                                               // (GPIO0 to 31)
#define GPIO_O_GPATOGGLE          0x6U         // GPIO A Data Toggle Register
                                               // (GPIO0 to 31)
#define GPIO_O_GPBDAT             0x8U         // GPIO B Data Register (GPIO32
                                               // to 63)
#define GPIO_O_GPBSET             0xAU         // GPIO B Data Set Register
                                               // (GPIO32 to 63)
#define GPIO_O_GPBCLEAR           0xCU         // GPIO B Data Clear Register
                                               // (GPIO32 to 63)
#define GPIO_O_GPBTOGGLE          0xEU         // GPIO B Data Toggle Register
                                               // (GPIO32 to 63)
#define GPIO_O_GPCDAT             0x10U        // GPIO C Data Register (GPIO64
                                               // to 95)
#define GPIO_O_GPCSET             0x12U        // GPIO C Data Set Register
                                               // (GPIO64 to 95)
#define GPIO_O_GPCCLEAR           0x14U        // GPIO C Data Clear Register
                                               // (GPIO64 to 95)
#define GPIO_O_GPCTOGGLE          0x16U        // GPIO C Data Toggle Register
                                               // (GPIO64 to 95)
#define GPIO_O_GPDDAT             0x18U        // GPIO D Data Register (GPIO96
                                               // to 127)
#define GPIO_O_GPDSET             0x1AU        // GPIO D Data Set Register
                                               // (GPIO96 to 127)
#define GPIO_O_GPDCLEAR           0x1CU        // GPIO D Data Clear Register
                                               // (GPIO96 to 127)
#define GPIO_O_GPDTOGGLE          0x1EU        // GPIO D Data Toggle Register
                                               // (GPIO96 to 127)
#define GPIO_O_GPEDAT             0x20U        // GPIO E Data Register (GPIO128
                                               // to 159)
#define GPIO_O_GPESET             0x22U        // GPIO E Data Set Register
                                               // (GPIO128 to 159)
#define GPIO_O_GPECLEAR           0x24U        // GPIO E Data Clear Register
                                               // (GPIO128 to 159)
#define GPIO_O_GPETOGGLE          0x26U        // GPIO E Data Toggle Register
                                               // (GPIO128 to 159)
#define GPIO_O_GPFDAT             0x28U        // GPIO F Data Register (GPIO160
                                               // to 168)
#define GPIO_O_GPFSET             0x2AU        // GPIO F Data Set Register
                                               // (GPIO160 to 168)
#define GPIO_O_GPFCLEAR           0x2CU        // GPIO F Data Clear Register
                                               // (GPIO160 to 168)
#define GPIO_O_GPFTOGGLE          0x2EU        // GPIO F Data Toggle Register
                                               // (GPIO160 to 168)

//*****************************************************************************
//
// The following are defines for the bit fields in the GPACTRL register
//
//*****************************************************************************
#define GPIO_GPACTRL_QUALPRD0_S   0U
#define GPIO_GPACTRL_QUALPRD0_M   0xFFU        // Qualification sampling period
                                               // for GPIO0 to GPIO7
#define GPIO_GPACTRL_QUALPRD1_S   8U
#define GPIO_GPACTRL_QUALPRD1_M   0xFF00U      // Qualification sampling period
                                               // for GPIO8 to GPIO15
#define GPIO_GPACTRL_QUALPRD2_S   16U
#define GPIO_GPACTRL_QUALPRD2_M   0xFF0000U    // Qualification sampling period
                                               // for GPIO16 to GPIO23
#define GPIO_GPACTRL_QUALPRD3_S   24U
#define GPIO_GPACTRL_QUALPRD3_M   0xFF000000U  // Qualification sampling period
                                               // for GPIO24 to GPIO31

