Simsoniteee/TestRepo/F2837x_uart_fifo/device/driverlib/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPAQSEL1 register
//
//*****************************************************************************
#define GPIO_GPAQSEL1_GPIO0_S     0U
#define GPIO_GPAQSEL1_GPIO0_M     0x3U         // Select input qualification
                                               // type for GPIO0
#define GPIO_GPAQSEL1_GPIO1_S     2U
#define GPIO_GPAQSEL1_GPIO1_M     0xCU         // Select input qualification
                                               // type for GPIO1
#define GPIO_GPAQSEL1_GPIO2_S     4U
#define GPIO_GPAQSEL1_GPIO2_M     0x30U        // Select input qualification
                                               // type for GPIO2
#define GPIO_GPAQSEL1_GPIO3_S     6U
#define GPIO_GPAQSEL1_GPIO3_M     0xC0U        // Select input qualification
                                               // type for GPIO3
#define GPIO_GPAQSEL1_GPIO4_S     8U
#define GPIO_GPAQSEL1_GPIO4_M     0x300U       // Select input qualification
                                               // type for GPIO4
#define GPIO_GPAQSEL1_GPIO5_S     10U
#define GPIO_GPAQSEL1_GPIO5_M     0xC00U       // Select input qualification
                                               // type for GPIO5
#define GPIO_GPAQSEL1_GPIO6_S     12U
#define GPIO_GPAQSEL1_GPIO6_M     0x3000U      // Select input qualification
                                               // type for GPIO6
#define GPIO_GPAQSEL1_GPIO7_S     14U
#define GPIO_GPAQSEL1_GPIO7_M     0xC000U      // Select input qualification
                                               // type for GPIO7
#define GPIO_GPAQSEL1_GPIO8_S     16U
#define GPIO_GPAQSEL1_GPIO8_M     0x30000U     // Select input qualification
                                               // type for GPIO8
#define GPIO_GPAQSEL1_GPIO9_S     18U
#define GPIO_GPAQSEL1_GPIO9_M     0xC0000U     // Select input qualification
                                               // type for GPIO9
#define GPIO_GPAQSEL1_GPIO10_S    20U
#define GPIO_GPAQSEL1_GPIO10_M    0x300000U    // Select input qualification
                                               // type for GPIO10
#define GPIO_GPAQSEL1_GPIO11_S    22U
#define GPIO_GPAQSEL1_GPIO11_M    0xC00000U    // Select input qualification
                                               // type for GPIO11
#define GPIO_GPAQSEL1_GPIO12_S    24U
#define GPIO_GPAQSEL1_GPIO12_M    0x3000000U   // Select input qualification
                                               // type for GPIO12
#define GPIO_GPAQSEL1_GPIO13_S    26U
#define GPIO_GPAQSEL1_GPIO13_M    0xC000000U   // Select input qualification
                                               // type for GPIO13
#define GPIO_GPAQSEL1_GPIO14_S    28U
#define GPIO_GPAQSEL1_GPIO14_M    0x30000000U  // Select input qualification
                                               // type for GPIO14
#define GPIO_GPAQSEL1_GPIO15_S    30U
#define GPIO_GPAQSEL1_GPIO15_M    0xC0000000U  // Select input qualification
                                               // type for GPIO15

//*****************************************************************************
//
// The following are defines for the bit fields in the GPAQSEL2 register
//
//*****************************************************************************
#define GPIO_GPAQSEL2_GPIO16_S    0U
#define GPIO_GPAQSEL2_GPIO16_M    0x3U         // Select input qualification
                                               // type for GPIO16
#define GPIO_GPAQSEL2_GPIO17_S    2U
#define GPIO_GPAQSEL2_GPIO17_M    0xCU         // Select input qualification
                                               // type for GPIO17
#define GPIO_GPAQSEL2_GPIO18_S    4U
#define GPIO_GPAQSEL2_GPIO18_M    0x30U        // Select input qualification
                                               // type for GPIO18
#define GPIO_GPAQSEL2_GPIO19_S    6U
#define GPIO_GPAQSEL2_GPIO19_M    0xC0U        // Select input qualification
                                               // type for GPIO19
#define GPIO_GPAQSEL2_GPIO20_S    8U
#define GPIO_GPAQSEL2_GPIO20_M    0x300U       // Select input qualification
                                               // type for GPIO20
#define GPIO_GPAQSEL2_GPIO21_S    10U
#define GPIO_GPAQSEL2_GPIO21_M    0xC00U       // Select input qualification
                                               // type for GPIO21
#define GPIO_GPAQSEL2_GPIO22_S    12U
#define GPIO_GPAQSEL2_GPIO22_M    0x3000U      // Select input qualification
                                               // type for GPIO22
#define GPIO_GPAQSEL2_GPIO23_S    14U
#define GPIO_GPAQSEL2_GPIO23_M    0xC000U      // Select input qualification
                                               // type for GPIO23
#define GPIO_GPAQSEL2_GPIO24_S    16U
#define GPIO_GPAQSEL2_GPIO24_M    0x30000U     // Select input qualification
                                               // type for GPIO24
#define GPIO_GPAQSEL2_GPIO25_S    18U
#define GPIO_GPAQSEL2_GPIO25_M    0xC0000U     // Select input qualification
                                               // type for GPIO25
#define GPIO_GPAQSEL2_GPIO26_S    20U
#define GPIO_GPAQSEL2_GPIO26_M    0x300000U    // Select input qualification
                                               // type for GPIO26
#define GPIO_GPAQSEL2_GPIO27_S    22U
#define GPIO_GPAQSEL2_GPIO27_M    0xC00000U    // Select input qualification
                                               // type for GPIO27
#define GPIO_GPAQSEL2_GPIO28_S    24U
#define GPIO_GPAQSEL2_GPIO28_M    0x3000000U   // Select input qualification
                                               // type for GPIO28
#define GPIO_GPAQSEL2_GPIO29_S    26U
#define GPIO_GPAQSEL2_GPIO29_M    0xC000000U   // Select input qualification
                                               // type for GPIO29
#define GPIO_GPAQSEL2_GPIO30_S    28U
#define GPIO_GPAQSEL2_GPIO30_M    0x30000000U  // Select input qualification
                                               // type for GPIO30
#define GPIO_GPAQSEL2_GPIO31_S    30U
#define GPIO_GPAQSEL2_GPIO31_M    0xC0000000U  // Select input qualification
                                               // type for GPIO31

//*****************************************************************************
//
// The following are defines for the bit fields in the GPAMUX1 register
//
//*****************************************************************************
#define GPIO_GPAMUX1_GPIO0_S      0U
#define GPIO_GPAMUX1_GPIO0_M      0x3U         // Defines pin-muxing selection
                                               // for GPIO0
#define GPIO_GPAMUX1_GPIO1_S      2U
#define GPIO_GPAMUX1_GPIO1_M      0xCU         // Defines pin-muxing selection
                                               // for GPIO1
#define GPIO_GPAMUX1_GPIO2_S      4U
#define GPIO_GPAMUX1_GPIO2_M      0x30U        // Defines pin-muxing selection
                                               // for GPIO2
#define GPIO_GPAMUX1_GPIO3_S      6U
#define GPIO_GPAMUX1_GPIO3_M      0xC0U        // Defines pin-muxing selection
                                               // for GPIO3
#define GPIO_GPAMUX1_GPIO4_S      8U
#define GPIO_GPAMUX1_GPIO4_M      0x300U       // Defines pin-muxing selection
                                               // for GPIO4
#define GPIO_GPAMUX1_GPIO5_S      10U
#define GPIO_GPAMUX1_GPIO5_M      0xC00U       // Defines pin-muxing selection
                                               // for GPIO5
#define GPIO_GPAMUX1_GPIO6_S      12U
#define GPIO_GPAMUX1_GPIO6_M      0x3000U      // Defines pin-muxing selection
                                               // for GPIO6
#define GPIO_GPAMUX1_GPIO7_S      14U
#define GPIO_GPAMUX1_GPIO7_M      0xC000U      // Defines pin-muxing selection
                                               // for GPIO7
#define GPIO_GPAMUX1_GPIO8_S      16U
#define GPIO_GPAMUX1_GPIO8_M      0x30000U     // Defines pin-muxing selection
                                               // for GPIO8
#define GPIO_GPAMUX1_GPIO9_S      18U
#define GPIO_GPAMUX1_GPIO9_M      0xC0000U     // Defines pin-muxing selection
                                               // for GPIO9
#define GPIO_GPAMUX1_GPIO10_S     20U
#define GPIO_GPAMUX1_GPIO10_M     0x300000U    // Defines pin-muxing selection
                                               // for GPIO10
#define GPIO_GPAMUX1_GPIO11_S     22U
#define GPIO_GPAMUX1_GPIO11_M     0xC00000U    // Defines pin-muxing selection
                                               // for GPIO11
#define GPIO_GPAMUX1_GPIO12_S     24U
#define GPIO_GPAMUX1_GPIO12_M     0x3000000U   // Defines pin-muxing selection
                                               // for GPIO12
#define GPIO_GPAMUX1_GPIO13_S     26U
#define GPIO_GPAMUX1_GPIO13_M     0xC000000U   // Defines pin-muxing selection
                                               // for GPIO13
#define GPIO_GPAMUX1_GPIO14_S     28U
#define GPIO_GPAMUX1_GPIO14_M     0x30000000U  // Defines pin-muxing selection
                                               // for GPIO14
#define GPIO_GPAMUX1_GPIO15_S     30U
#define GPIO_GPAMUX1_GPIO15_M     0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO15

//*****************************************************************************
//
// The following are defines for the bit fields in the GPAMUX2 register
//
//*****************************************************************************
#define GPIO_GPAMUX2_GPIO16_S     0U
#define GPIO_GPAMUX2_GPIO16_M     0x3U         // Defines pin-muxing selection
                                               // for GPIO16
#define GPIO_GPAMUX2_GPIO17_S     2U
#define GPIO_GPAMUX2_GPIO17_M     0xCU         // Defines pin-muxing selection
                                               // for GPIO17
#define GPIO_GPAMUX2_GPIO18_S     4U
#define GPIO_GPAMUX2_GPIO18_M     0x30U        // Defines pin-muxing selection
                                               // for GPIO18
#define GPIO_GPAMUX2_GPIO19_S     6U
#define GPIO_GPAMUX2_GPIO19_M     0xC0U        // Defines pin-muxing selection
                                               // for GPIO19
#define GPIO_GPAMUX2_GPIO20_S     8U
#define GPIO_GPAMUX2_GPIO20_M     0x300U       // Defines pin-muxing selection
                                               // for GPIO20
#define GPIO_GPAMUX2_GPIO21_S     10U
#define GPIO_GPAMUX2_GPIO21_M     0xC00U       // Defines pin-muxing selection
                                               // for GPIO21
#define GPIO_GPAMUX2_GPIO22_S     12U
#define GPIO_GPAMUX2_GPIO22_M     0x3000U      // Defines pin-muxing selection
                                               // for GPIO22
#define GPIO_GPAMUX2_GPIO23_S     14U
#define GPIO_GPAMUX2_GPIO23_M     0xC000U      // Defines pin-muxing selection
                                               // for GPIO23
#define GPIO_GPAMUX2_GPIO24_S     16U
#define GPIO_GPAMUX2_GPIO24_M     0x30000U     // Defines pin-muxing selection
                                               // for GPIO24
#define GPIO_GPAMUX2_GPIO25_S     18U
#define GPIO_GPAMUX2_GPIO25_M     0xC0000U     // Defines pin-muxing selection
                                               // for GPIO25
#define GPIO_GPAMUX2_GPIO26_S     20U
#define GPIO_GPAMUX2_GPIO26_M     0x300000U    // Defines pin-muxing selection
                                               // for GPIO26
#define GPIO_GPAMUX2_GPIO27_S     22U
#define GPIO_GPAMUX2_GPIO27_M     0xC00000U    // Defines pin-muxing selection
                                               // for GPIO27
#define GPIO_GPAMUX2_GPIO28_S     24U
#define GPIO_GPAMUX2_GPIO28_M     0x3000000U   // Defines pin-muxing selection
                                               // for GPIO28
#define GPIO_GPAMUX2_GPIO29_S     26U
#define GPIO_GPAMUX2_GPIO29_M     0xC000000U   // Defines pin-muxing selection
                                               // for GPIO29
#define GPIO_GPAMUX2_GPIO30_S     28U
#define GPIO_GPAMUX2_GPIO30_M     0x30000000U  // Defines pin-muxing selection
                                               // for GPIO30
#define GPIO_GPAMUX2_GPIO31_S     30U
#define GPIO_GPAMUX2_GPIO31_M     0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO31

//*****************************************************************************
//
// The following are defines for the bit fields in the GPADIR register
//
//*****************************************************************************
#define GPIO_GPADIR_GPIO0         0x1U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO1         0x2U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO2         0x4U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO3         0x8U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO4         0x10U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO5         0x20U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO6         0x40U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO7         0x80U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO8         0x100U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO9         0x200U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO10        0x400U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO11        0x800U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO12        0x1000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO13        0x2000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO14        0x4000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO15        0x8000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO16        0x10000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO17        0x20000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO18        0x40000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO19        0x80000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO20        0x100000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO21        0x200000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO22        0x400000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO23        0x800000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO24        0x1000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO25        0x2000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO26        0x4000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO27        0x8000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO28        0x10000000U  // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO29        0x20000000U  // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO30        0x40000000U  // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPADIR_GPIO31        0x80000000U  // Defines direction for this
                                               // pin in GPIO mode

//*****************************************************************************
//
// The following are defines for the bit fields in the GPAPUD register
//
//*****************************************************************************
#define GPIO_GPAPUD_GPIO0         0x1U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO1         0x2U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO2         0x4U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO3         0x8U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO4         0x10U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO5         0x20U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO6         0x40U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO7         0x80U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO8         0x100U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO9         0x200U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO10        0x400U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO11        0x800U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO12        0x1000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO13        0x2000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO14        0x4000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO15        0x8000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO16        0x10000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO17        0x20000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO18        0x40000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO19        0x80000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO20        0x100000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO21        0x200000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO22        0x400000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO23        0x800000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO24        0x1000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO25        0x2000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO26        0x4000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO27        0x8000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO28        0x10000000U  // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO29        0x20000000U  // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO30        0x40000000U  // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPAPUD_GPIO31        0x80000000U  // Pull-Up Disable control for
                                               // this pin

