Simsoniteee/TestRepo/F2837x_uart_fifo/device/driverlib/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPCQSEL2 register
//
//*****************************************************************************
#define GPIO_GPCQSEL2_GPIO80_S    0U
#define GPIO_GPCQSEL2_GPIO80_M    0x3U         // Select input qualification
                                               // type for GPIO80
#define GPIO_GPCQSEL2_GPIO81_S    2U
#define GPIO_GPCQSEL2_GPIO81_M    0xCU         // Select input qualification
                                               // type for GPIO81
#define GPIO_GPCQSEL2_GPIO82_S    4U
#define GPIO_GPCQSEL2_GPIO82_M    0x30U        // Select input qualification
                                               // type for GPIO82
#define GPIO_GPCQSEL2_GPIO83_S    6U
#define GPIO_GPCQSEL2_GPIO83_M    0xC0U        // Select input qualification
                                               // type for GPIO83
#define GPIO_GPCQSEL2_GPIO84_S    8U
#define GPIO_GPCQSEL2_GPIO84_M    0x300U       // Select input qualification
                                               // type for GPIO84
#define GPIO_GPCQSEL2_GPIO85_S    10U
#define GPIO_GPCQSEL2_GPIO85_M    0xC00U       // Select input qualification
                                               // type for GPIO85
#define GPIO_GPCQSEL2_GPIO86_S    12U
#define GPIO_GPCQSEL2_GPIO86_M    0x3000U      // Select input qualification
                                               // type for GPIO86
#define GPIO_GPCQSEL2_GPIO87_S    14U
#define GPIO_GPCQSEL2_GPIO87_M    0xC000U      // Select input qualification
                                               // type for GPIO87
#define GPIO_GPCQSEL2_GPIO88_S    16U
#define GPIO_GPCQSEL2_GPIO88_M    0x30000U     // Select input qualification
                                               // type for GPIO88
#define GPIO_GPCQSEL2_GPIO89_S    18U
#define GPIO_GPCQSEL2_GPIO89_M    0xC0000U     // Select input qualification
                                               // type for GPIO89
#define GPIO_GPCQSEL2_GPIO90_S    20U
#define GPIO_GPCQSEL2_GPIO90_M    0x300000U    // Select input qualification
                                               // type for GPIO90
#define GPIO_GPCQSEL2_GPIO91_S    22U
#define GPIO_GPCQSEL2_GPIO91_M    0xC00000U    // Select input qualification
                                               // type for GPIO91
#define GPIO_GPCQSEL2_GPIO92_S    24U
#define GPIO_GPCQSEL2_GPIO92_M    0x3000000U   // Select input qualification
                                               // type for GPIO92
#define GPIO_GPCQSEL2_GPIO93_S    26U
#define GPIO_GPCQSEL2_GPIO93_M    0xC000000U   // Select input qualification
                                               // type for GPIO93
#define GPIO_GPCQSEL2_GPIO94_S    28U
#define GPIO_GPCQSEL2_GPIO94_M    0x30000000U  // Select input qualification
                                               // type for GPIO94
#define GPIO_GPCQSEL2_GPIO95_S    30U
#define GPIO_GPCQSEL2_GPIO95_M    0xC0000000U  // Select input qualification
                                               // type for GPIO95

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCMUX1 register
//
//*****************************************************************************
#define GPIO_GPCMUX1_GPIO64_S     0U
#define GPIO_GPCMUX1_GPIO64_M     0x3U         // Defines pin-muxing selection
                                               // for GPIO64
#define GPIO_GPCMUX1_GPIO65_S     2U
#define GPIO_GPCMUX1_GPIO65_M     0xCU         // Defines pin-muxing selection
                                               // for GPIO65
#define GPIO_GPCMUX1_GPIO66_S     4U
#define GPIO_GPCMUX1_GPIO66_M     0x30U        // Defines pin-muxing selection
                                               // for GPIO66
#define GPIO_GPCMUX1_GPIO67_S     6U
#define GPIO_GPCMUX1_GPIO67_M     0xC0U        // Defines pin-muxing selection
                                               // for GPIO67
#define GPIO_GPCMUX1_GPIO68_S     8U
#define GPIO_GPCMUX1_GPIO68_M     0x300U       // Defines pin-muxing selection
                                               // for GPIO68
#define GPIO_GPCMUX1_GPIO69_S     10U
#define GPIO_GPCMUX1_GPIO69_M     0xC00U       // Defines pin-muxing selection
                                               // for GPIO69
#define GPIO_GPCMUX1_GPIO70_S     12U
#define GPIO_GPCMUX1_GPIO70_M     0x3000U      // Defines pin-muxing selection
                                               // for GPIO70
#define GPIO_GPCMUX1_GPIO71_S     14U
#define GPIO_GPCMUX1_GPIO71_M     0xC000U      // Defines pin-muxing selection
                                               // for GPIO71
#define GPIO_GPCMUX1_GPIO72_S     16U
#define GPIO_GPCMUX1_GPIO72_M     0x30000U     // Defines pin-muxing selection
                                               // for GPIO72
#define GPIO_GPCMUX1_GPIO73_S     18U
#define GPIO_GPCMUX1_GPIO73_M     0xC0000U     // Defines pin-muxing selection
                                               // for GPIO73
#define GPIO_GPCMUX1_GPIO74_S     20U
#define GPIO_GPCMUX1_GPIO74_M     0x300000U    // Defines pin-muxing selection
                                               // for GPIO74
#define GPIO_GPCMUX1_GPIO75_S     22U
#define GPIO_GPCMUX1_GPIO75_M     0xC00000U    // Defines pin-muxing selection
                                               // for GPIO75
#define GPIO_GPCMUX1_GPIO76_S     24U
#define GPIO_GPCMUX1_GPIO76_M     0x3000000U   // Defines pin-muxing selection
                                               // for GPIO76
#define GPIO_GPCMUX1_GPIO77_S     26U
#define GPIO_GPCMUX1_GPIO77_M     0xC000000U   // Defines pin-muxing selection
                                               // for GPIO77
#define GPIO_GPCMUX1_GPIO78_S     28U
#define GPIO_GPCMUX1_GPIO78_M     0x30000000U  // Defines pin-muxing selection
                                               // for GPIO78
#define GPIO_GPCMUX1_GPIO79_S     30U
#define GPIO_GPCMUX1_GPIO79_M     0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO79

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCMUX2 register
//
//*****************************************************************************
#define GPIO_GPCMUX2_GPIO80_S     0U
#define GPIO_GPCMUX2_GPIO80_M     0x3U         // Defines pin-muxing selection
                                               // for GPIO80
#define GPIO_GPCMUX2_GPIO81_S     2U
#define GPIO_GPCMUX2_GPIO81_M     0xCU         // Defines pin-muxing selection
                                               // for GPIO81
#define GPIO_GPCMUX2_GPIO82_S     4U
#define GPIO_GPCMUX2_GPIO82_M     0x30U        // Defines pin-muxing selection
                                               // for GPIO82
#define GPIO_GPCMUX2_GPIO83_S     6U
#define GPIO_GPCMUX2_GPIO83_M     0xC0U        // Defines pin-muxing selection
                                               // for GPIO83
#define GPIO_GPCMUX2_GPIO84_S     8U
#define GPIO_GPCMUX2_GPIO84_M     0x300U       // Defines pin-muxing selection
                                               // for GPIO84
#define GPIO_GPCMUX2_GPIO85_S     10U
#define GPIO_GPCMUX2_GPIO85_M     0xC00U       // Defines pin-muxing selection
                                               // for GPIO85
#define GPIO_GPCMUX2_GPIO86_S     12U
#define GPIO_GPCMUX2_GPIO86_M     0x3000U      // Defines pin-muxing selection
                                               // for GPIO86
#define GPIO_GPCMUX2_GPIO87_S     14U
#define GPIO_GPCMUX2_GPIO87_M     0xC000U      // Defines pin-muxing selection
                                               // for GPIO87
#define GPIO_GPCMUX2_GPIO88_S     16U
#define GPIO_GPCMUX2_GPIO88_M     0x30000U     // Defines pin-muxing selection
                                               // for GPIO88
#define GPIO_GPCMUX2_GPIO89_S     18U
#define GPIO_GPCMUX2_GPIO89_M     0xC0000U     // Defines pin-muxing selection
                                               // for GPIO89
#define GPIO_GPCMUX2_GPIO90_S     20U
#define GPIO_GPCMUX2_GPIO90_M     0x300000U    // Defines pin-muxing selection
                                               // for GPIO90
#define GPIO_GPCMUX2_GPIO91_S     22U
#define GPIO_GPCMUX2_GPIO91_M     0xC00000U    // Defines pin-muxing selection
                                               // for GPIO91
#define GPIO_GPCMUX2_GPIO92_S     24U
#define GPIO_GPCMUX2_GPIO92_M     0x3000000U   // Defines pin-muxing selection
                                               // for GPIO92
#define GPIO_GPCMUX2_GPIO93_S     26U
#define GPIO_GPCMUX2_GPIO93_M     0xC000000U   // Defines pin-muxing selection
                                               // for GPIO93
#define GPIO_GPCMUX2_GPIO94_S     28U
#define GPIO_GPCMUX2_GPIO94_M     0x30000000U  // Defines pin-muxing selection
                                               // for GPIO94
#define GPIO_GPCMUX2_GPIO95_S     30U
#define GPIO_GPCMUX2_GPIO95_M     0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO95

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCDIR register
//
//*****************************************************************************
#define GPIO_GPCDIR_GPIO64        0x1U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO65        0x2U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO66        0x4U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO67        0x8U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO68        0x10U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO69        0x20U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO70        0x40U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO71        0x80U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO72        0x100U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO73        0x200U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO74        0x400U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO75        0x800U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO76        0x1000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO77        0x2000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO78        0x4000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO79        0x8000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO80        0x10000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO81        0x20000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO82        0x40000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO83        0x80000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO84        0x100000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO85        0x200000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO86        0x400000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO87        0x800000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO88        0x1000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO89        0x2000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO90        0x4000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO91        0x8000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO92        0x10000000U  // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO93        0x20000000U  // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO94        0x40000000U  // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPCDIR_GPIO95        0x80000000U  // Defines direction for this
                                               // pin in GPIO mode

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCPUD register
//
//*****************************************************************************
#define GPIO_GPCPUD_GPIO64        0x1U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO65        0x2U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO66        0x4U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO67        0x8U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO68        0x10U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO69        0x20U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO70        0x40U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO71        0x80U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO72        0x100U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO73        0x200U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO74        0x400U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO75        0x800U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO76        0x1000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO77        0x2000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO78        0x4000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO79        0x8000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO80        0x10000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO81        0x20000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO82        0x40000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO83        0x80000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO84        0x100000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO85        0x200000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO86        0x400000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO87        0x800000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO88        0x1000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO89        0x2000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO90        0x4000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO91        0x8000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO92        0x10000000U  // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO93        0x20000000U  // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO94        0x40000000U  // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPCPUD_GPIO95        0x80000000U  // Pull-Up Disable control for
                                               // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCINV register
//
//*****************************************************************************
#define GPIO_GPCINV_GPIO64        0x1U         // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO65        0x2U         // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO66        0x4U         // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO67        0x8U         // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO68        0x10U        // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO69        0x20U        // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO70        0x40U        // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO71        0x80U        // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO72        0x100U       // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO73        0x200U       // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO74        0x400U       // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO75        0x800U       // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO76        0x1000U      // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO77        0x2000U      // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO78        0x4000U      // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO79        0x8000U      // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO80        0x10000U     // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO81        0x20000U     // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO82        0x40000U     // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO83        0x80000U     // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO84        0x100000U    // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO85        0x200000U    // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO86        0x400000U    // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO87        0x800000U    // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO88        0x1000000U   // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO89        0x2000000U   // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO90        0x4000000U   // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO91        0x8000000U   // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO92        0x10000000U  // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO93        0x20000000U  // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO94        0x40000000U  // Input inversion control for
                                               // this pin
#define GPIO_GPCINV_GPIO95        0x80000000U  // Input inversion control for
                                               // this pin

